#### Q1. List any five functions of the pandas library with execution.

In [ ]:
Pandas Functions â€“ 
_ read_csv() :- Load data from a CSV file.
_ fillna() :- Replace missing values in a DataFrame.
_ mean() :- Calculate the mean of a Series or DataFrame.
_ std() :- Calculate the standard deviation of a Series or DataFrame.
_ describe() :- Calculate summary statistics for a Series or DataFrame.

#### Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
####   DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [5]:
import pandas as pd

df = pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

In [3]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [6]:
df['Name'][1:6:2]

1    Cumings, Mrs. John Bradley (Florence Briggs Th...
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)
5                                     Moran, Mr. James
Name: Name, dtype: object

#### Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
#### iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
#### function should print the sum to the console.

In [54]:
d={'values':[3,4,5,6,7],      
   'num':[5,6,7,8,9],       
   'count':[7,5,6,7,8]}

In [55]:
df = pd.DataFrame(d)

In [56]:
df

   values  num  count
0       3    5      7
1       4    6      5
2       5    7      6
3       6    8      7
4       7    9      8

In [57]:
df = df.loc[0 : 2,['values']].sum(axis = 0) 
print(df)

values    12
dtype: int64

#### Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
#### 'Word_Count' that contains the number of words in each row of the 'Text' column.

In [82]:
d={'Text':['ansh','hello','pandas','language']}

In [83]:
df=pd.DataFrame(d)

In [84]:
df

       Text
0      ansh
1     hello
2    pandas
3  language

In [87]:
df['Word_Count'] = df['Text'].str.len()

In [88]:
df

       Text  Word_Count
0      ansh           4
1     hello           5
2    pandas           6
3  language           8

#### Q5. How are DataFrame.size() and DataFrame.shape() different?

In [4]:
# DataFrame.size() :- The size property is used to get an int representing the number of elements in this object and 
#                       Return the number of rows if Series.

In [3]:
# DataFrame.shape() :- The shape property is used to get a tuple representing the dimensionality of the Pandas DataFrame.

#### Q6. Which function of pandas do we use to read an excel file?

In [ ]:
# pandas.read excel() is pandas read_excel function which is used to read the excel sheets with extensions 
#       (.xlsx, .xls, .xlsx, .xlsm, .xlsb, .odf, .ods and .odt) into pandas DataFrame object.

#### Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
#### addresses in the format 'username@domain.com'. Write a Python function that creates a new column
#### 'Username' in df that contains only the username part of each email address.

In [10]:
d ={'Email':['ansh@pw.com',
        'karan@pw.com',
        'arun@pw.com',
        'disco@pw.com']}

In [11]:
df= pd.DataFrame(d)

In [12]:
df

          Email
0   ansh@pw.com
1  karan@pw.com
2   arun@pw.com
3  disco@pw.com

In [18]:
df['Username'] = df['Email'].str.split('@').str[0]

In [19]:
df

          Email Username
0   ansh@pw.com     ansh
1  karan@pw.com    karan
2   arun@pw.com     arun
3  disco@pw.com    disco

#### Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
#### all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
#### function should return a new DataFrame that contains only the selected rows.

In [20]:
d={'A':[3,8,6,2,9],
   'B':[5,2,9,3,1],
   'C':[1,7,4,5,2]}

In [21]:
df=pd.DataFrame(d)

In [54]:
df

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

In [55]:
df1 = df.query('A > 5 and B < 10')

In [56]:
df1

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

#### Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
#### median, and standard deviation of the values in the 'Values' column.

In [57]:
d={'Values':[2,41,21,7,8],
   'num':[62,3,42,51,5],
    'count':[44,5,6,7,8]}

In [58]:
df=pd.DataFrame(d)

In [59]:
df

   Values  num  count
0       2   62     44
1      41    3      5
2      21   42      6
3       7   51      7
4       8    5      8

In [63]:
df.mean()['Values']

15.8

In [65]:
df.median()['Values']

8.0

In [66]:
df.std()['Values']

15.738487856207788

#### Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
#### create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
#### for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
#### should include the current day.

In [149]:
d={'Sales':[45,23,63,53,42,5,7,32,42],
   'Date':['11-9-2023','13-9-2023','15-9-2023','19-9-2023','23-9-2023','25-9-2023','26-9-2023','28-9-2023','01-10-2023']}

In [150]:
df=pd.DataFrame(d)

In [151]:
df

   Sales        Date
0     45   11-9-2023
1     23   13-9-2023
2     63   15-9-2023
3     53   19-9-2023
4     42   23-9-2023
5      5   25-9-2023
6      7   26-9-2023
7     32   28-9-2023
8     42  01-10-2023

In [152]:
df['MovingAverage'] = df['Sales'].rolling(7).mean()     # using .rolling(window).mean()

In [153]:
#df.dropna(inplace=True)

In [154]:
df

   Sales        Date  MovingAverage
0     45   11-9-2023            NaN
1     23   13-9-2023            NaN
2     63   15-9-2023            NaN
3     53   19-9-2023            NaN
4     42   23-9-2023            NaN
5      5   25-9-2023            NaN
6      7   26-9-2023      34.000000
7     32   28-9-2023      32.142857
8     42  01-10-2023      34.857143

#### Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
#### column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
#### Monday, Tuesday) corresponding to each date in the 'Date' column.

In [181]:
d={'Date':['2023-11-01','2023-11-02','2023-11-05','2023-11-07','2023-11-09','2023-11-10','2023-11-11','2023-11-12','2023-11-14'],
   'Vals':[1, 2, 3, 4, 5,6,7,8,9]}

In [182]:
df=pd.DataFrame(d)

In [183]:
df

         Date  Vals
0  2023-11-01     1
1  2023-11-02     2
2  2023-11-05     3
3  2023-11-07     4
4  2023-11-09     5
5  2023-11-10     6
6  2023-11-11     7
7  2023-11-12     8
8  2023-11-14     9

In [186]:
df['Date'] = pd.to_datetime(df['Date']) 
df['Weekday'] = df['Date'].dt.day_name()

In [187]:
df

        Date  Vals    Weekday
0 2023-11-01     1  Wednesday
1 2023-11-02     2   Thursday
2 2023-11-05     3     Sunday
3 2023-11-07     4    Tuesday
4 2023-11-09     5   Thursday
5 2023-11-10     6     Friday
6 2023-11-11     7   Saturday
7 2023-11-12     8     Sunday
8 2023-11-14     9    Tuesday

#### Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
#### function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [202]:
d={'Date':['2023-01-02','2023-01-05','2023-01-09','2023-02-01','2023-02-03','2023-01-15','2023-02-05','2023-02-07','2023-02-09'],}

In [203]:
df=pd.DataFrame(d)

In [204]:
df

         Date
0  2023-01-02
1  2023-01-05
2  2023-01-09
3  2023-02-01
4  2023-02-03
5  2023-01-15
6  2023-02-05
7  2023-02-07
8  2023-02-09

In [205]:
df['Date'] = pd.to_datetime(df['Date'], format='%Y-%m-%d')

In [206]:
df = df.loc[(df['Date'] >= '2023-01-01')
                     & (df['Date'] < '2023-01-31')]

In [207]:
df

        Date
0 2023-01-02
1 2023-01-05
2 2023-01-09
5 2023-01-15

#### Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to
#### be imported?

In [208]:
import pandas as pd

In [209]:
# Pandas is a Python library used for working with data sets. It has functions for analyzing, cleaning, exploring, and manipulating data.